<a href="https://colab.research.google.com/github/sarahmilleraws/DATA_SCIENCE-Codes/blob/main/DAwPy_Pandas_130321.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
df5 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99],
                   'var2': [100,253,333,262,111,969]})
df5

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [3]:
df_t = df5.iloc[:,1:3]

In [4]:
df_t

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969

In [5]:
df_t.transform(lambda x: (x-x.mean()) / x.std())

       var1      var2
0 -0.687871 -0.738461
1 -0.299074 -0.263736
2  0.000000 -0.015514
3 -0.328982 -0.235811
4 -0.657963 -0.704331
5  1.973890  1.957853

In [10]:
(df_t.iloc[0,0] - df_t.var1.mean()) / df_t.var1.std()

-0.6878708952377661

In [7]:
df_t.var1.mean()

33.0

In [8]:
df_t.var1.std()

33.436506994600975

In [11]:
df_t.transform(lambda x : np.log(x) )

       var1      var2
0  2.302585  4.605170
1  3.135494  5.533389
2  3.496508  5.808142
3  3.091042  5.568345
4  2.397895  4.709530
5  4.595120  6.876265

In [12]:
np.log(10)

2.302585092994046

In [13]:
np.log(100)

4.605170185988092

In [14]:
np.log(23)

3.1354942159291497

In [15]:
df5

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [16]:
df5.apply(np.sum)

groups    ABCABC
var1         198
var2        2028
dtype: object

In [18]:
df5.var1.sum()

198

In [19]:
df5.groups.sum()

'ABCABC'

In [20]:
df_numeric = df5.iloc[:,1:3]

In [21]:
df_numeric

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969

In [22]:
df_numeric.apply(np.median)   #np.apply.median() hata verir. MEdiAN almak istediğimizde buradaki kod şeklinde yazılmalı.

var1     22.5
var2    257.5
dtype: float64

In [23]:
df_numeric.apply(np.mean)

var1     33.0
var2    338.0
dtype: float64

In [24]:
df_numeric.apply(np.mean, axis = 1)

0     55.0
1    138.0
2    183.0
3    142.0
4     61.0
5    534.0
dtype: float64

In [25]:
df5.groupby("groups").apply(np.mean)

        var1   var2
groups
A       16.0  181.0
B       17.0  182.0
C       66.0  651.0

In [26]:
df5

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [28]:
df5.groupby("groups").mean()

        var1  var2
groups
A         16   181
B         17   182
C         66   651

In [29]:
# Applying Functions using df2
df2 = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df2

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [30]:
def times2(x):
  return x*2

In [31]:
df2["col1"].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [32]:
df2["col3"].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [33]:
#df.transform vs df.apply()

In [34]:
df2

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [36]:
df2["col3"].transform(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [37]:
df2["col3"].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [38]:
df1 = pd.DataFrame([["a", 9, 25]] * 4, columns=["grp", 'P', 'Q'])
df2 = pd.DataFrame([["b", 9, 25]] * 3, columns=["grp", 'P', 'Q'])
df3 = pd.concat([df1, df2], ignore_index=True)
df3

  grp  P   Q
0   a  9  25
1   a  9  25
2   a  9  25
3   a  9  25
4   b  9  25
5   b  9  25
6   b  9  25

In [39]:
df3.apply(lambda x : x + x)

  grp   P   Q
0  aa  18  50
1  aa  18  50
2  aa  18  50
3  aa  18  50
4  bb  18  50
5  bb  18  50
6  bb  18  50

In [41]:
df3.transform(lambda y : y + y)

  grp   P   Q
0  aa  18  50
1  aa  18  50
2  aa  18  50
3  aa  18  50
4  bb  18  50
5  bb  18  50
6  bb  18  50

In [42]:
df3

  grp  P   Q
0   a  9  25
1   a  9  25
2   a  9  25
3   a  9  25
4   b  9  25
5   b  9  25
6   b  9  25

In [44]:
#apply implicitly passes all the columns for each group as a DataFrame to the custom function. -/
#while transform passes each column for each group individually as a Series to the custom function.-/

In [45]:
df3.groupby("grp").apply(sum)

      grp   P    Q
grp
a    aaaa  36  100
b     bbb  27   75

In [46]:
df3.groupby("grp").transform(sum)

    P    Q
0  36  100
1  36  100
2  36  100
3  36  100
4  27   75
5  27   75
6  27   75

In [48]:
#df3.transform(lambda x : x.sum())  #transform cannot produce aggregated results.

# **Pivot Table**

In [49]:
import seaborn as sns

In [50]:
titanic = sns.load_dataset("titanic")
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [51]:
len(titanic)

891

In [52]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [53]:
titanic.groupby(["sex", "class"])[["survived"]].mean()

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [55]:
titanic.groupby(["sex", "class"])[["survived"]].agg("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [56]:
titanic.pivot_table("survived", index = "sex", columns = "class")  #mean'i default hesaplıyor.

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [57]:
titanic.pivot_table("age", index = "sex", columns = "class")

class       First     Second      Third
sex
female  34.611765  28.722973  21.750000
male    41.281386  30.740707  26.507589

In [58]:
titanic.pivot_table("age", index = "class", columns = "sex")

sex        female       male
class
First   34.611765  41.281386
Second  28.722973  30.740707
Third   21.750000  26.507589

In [59]:
age = pd.cut(titanic["age"], [0,18,90])

In [60]:
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [62]:
titanic.pivot_table("survived", ["sex", age], "class")   #inclusive-exclusive=yaş grubunun gösterimi açık,kapalı parantez

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

# **Missing Values & Outliers**

In [64]:
df = pd.DataFrame({'A':[1, 2, np.nan],
                  'B':[5, np.nan, np.nan],
                  'C':[1, 2, 3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [65]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [66]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [67]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [68]:
df.fillna(value = "FILL VALUE")

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [69]:
df["A"].fillna(value = df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [70]:
V1 = np.array([2,3,5,np.NaN,7,1,np.NaN,10,14])
V2 = np.array([8,np.NaN,5,8,11,np.NaN,np.NaN,2,3])
V3 = np.array([np.NaN,13,5,6,13,7,np.NaN,3,30])
df = pd.DataFrame(
        {"Var1" : V1,
         "Var2" : V2,
         "Var3" : V3}
)
df

   Var1  Var2  Var3
0   2.0   8.0   NaN
1   3.0   NaN  13.0
2   5.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  11.0  13.0
5   1.0   NaN   7.0
6   NaN   NaN   NaN
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [71]:
df.isnull().sum()

Var1    2
Var2    3
Var3    2
dtype: int64

In [72]:
len(df)

9

In [73]:
df.isnull().sum() / len(df) * 100

Var1    22.222222
Var2    33.333333
Var3    22.222222
dtype: float64

In [74]:
df.notnull().sum()

Var1    7
Var2    6
Var3    7
dtype: int64

In [75]:
df.isnull().sum().sum()

7

In [77]:
df.isnull().any()  #nan ifade var mı sorguluyor

Var1    True
Var2    True
Var3    True
dtype: bool

In [78]:
#df.isna().apply(pd.value_counts) bu versiyon da özellikle sütun sayısı fazla olan df'ler için kullanılabilecek pratik bir kod

In [80]:
titanic["embark_town"].isnull().sum()

2

In [81]:
titanic["embark_town"].count()

889

In [82]:
titanic.pivot_table("survived", index="embark_town",columns="class")

class           First    Second     Third
embark_town
Cherbourg    0.694118  0.529412  0.378788
Queenstown   0.500000  0.666667  0.375000
Southampton  0.582677  0.463415  0.189802

In [83]:
df[df.isnull().any(axis = 1)]

   Var1  Var2  Var3
0   2.0   8.0   NaN
1   3.0   NaN  13.0
3   NaN   8.0   6.0
5   1.0   NaN   7.0
6   NaN   NaN   NaN

In [85]:
df.isnull().any(axis = 1)  #dfin ilgili satırında nan varsa False, yoksa True dönüyor.

0     True
1     True
2    False
3     True
4    False
5     True
6     True
7    False
8    False
dtype: bool

In [89]:
df[df.notnull().all(axis = 1)]   #null olmayanları getir

   Var1  Var2  Var3
2   5.0   5.0   5.0
4   7.0  11.0  13.0
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [90]:
df[df.isnull().any(axis=1)==False]  #False olanlar gelmesin

   Var1  Var2  Var3
2   5.0   5.0   5.0
4   7.0  11.0  13.0
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [91]:
  df[~df.isnull().any(axis = 1)]   # Başına ~ işareti koyarak null olanları getirmemesini sağlayabilirim

   Var1  Var2  Var3
2   5.0   5.0   5.0
4   7.0  11.0  13.0
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [92]:
df[df.Var1.notnull() & df.Var2.notnull()]

   Var1  Var2  Var3
0   2.0   8.0   NaN
2   5.0   5.0   5.0
4   7.0  11.0  13.0
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [93]:
df.dropna(how = "all")

   Var1  Var2  Var3
0   2.0   8.0   NaN
1   3.0   NaN  13.0
2   5.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  11.0  13.0
5   1.0   NaN   7.0
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [94]:
df.dropna(axis = 1, how = "all")  #bütün sütun nan'sa düşür

   Var1  Var2  Var3
0   2.0   8.0   NaN
1   3.0   NaN  13.0
2   5.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  11.0  13.0
5   1.0   NaN   7.0
6   NaN   NaN   NaN
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [96]:
df.dropna(axis = 1, how = "all", inplace = True) #orjinal dosyayı bu şekilde değiştirir.

In [97]:
df

   Var1  Var2  Var3
0   2.0   8.0   NaN
1   3.0   NaN  13.0
2   5.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  11.0  13.0
5   1.0   NaN   7.0
6   NaN   NaN   NaN
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [3]:
import numpy as np 
x = np.array([1, 10, 7, 12, 0, 30, 15, 22, 8, 2])
x.std()

9.089004345911603

In [4]:
import pandas as pd
from scipy import stats
y = np.array([9, 11, 4, 14, 8, 2, 10, 3, 10, 9, 6, 0, 1])
y

array([ 9, 11,  4, 14,  8,  2, 10,  3, 10,  9,  6,  0,  1])

In [5]:
stats.iqr(y)

7.0

In [6]:
z = np.array([8, 10, 4, 24, 8, 3, 10, 3, 40, 7, 6, 12, 4])
stats.iqr(z)

6.0